import React from "react";

const UserAgreementAndPrivacyPolicy = () => {
  return (
    <div>
      <div>
        更新日期：<strong>2023/9/9</strong>
      </div>
      <div>
        生效日期：<strong>2023/9/9</strong>
      </div>

      <div>
        <h1>用户协议</h1>
        <h2>导言</h2>
        <p>
          <i>星阳音乐系统</i> 是一款由 <i>小研同学</i> 开发、
          <i>小研同学</i> 运营（以下简称“我们”）的产品。
        </p>
        <p>
          本协议是星阳音乐系统用户与我们之间关于星阳音乐系统产品的使用协议。本协议规定了用户使用星阳音乐系统产品及服务时应遵循的条款与条件。用户确认，使用星阳音乐系统产品及服务即表示同意本协议的免除或限制责任条款等重要内容。若用户是未满
          18
          周岁的自然人，应在法定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用本服务。
        </p>
        <p>
          <strong>
            免责声明：本网站内容来源于网络，仅提供检索服务。本网站不存储任何内容，也不承担任何责任。如果您需要使用本网站提供的检索服务，您应当自行负责获取相关内容的合法性和准确性。此外，本网站保留随时修改本声明的权利。如果您继续使用本网站，即表示您已经接受了本声明的所有修改。
          </strong>
        </p>
        <p>
          如对本《用户协议》或相关事宜有任何问题，请通过{" "}
          <strong>public@singtech.top</strong>{" "}
          与我们联系。一般情况下，我们将在30天内回复。
        </p>
        <h2>服务内容</h2>
        <p>
          星阳音乐系统是一个由中学生开发的个人音乐欣赏的网站。具体包括但不限于以下内容：1.音乐收听；2.音乐信息查看等。
        </p>
        <h2>软件使用规范</h2>
        <ul>
          <li>不发布、分享、传播任何违法、敏感信息；</li>
          <li>不进行任何危害国家安全、社会稳定、个人隐私的行为；</li>
          <li>不侵犯他人合法权益，不进行任何形式的网络欺凌；</li>
          <li>不利用本服务进行任何商业活动；</li>
          <li>不进行任何违反法律法规、道德伦理的行为；</li>
          <li>
            不进行任何破解、修改、卡漏洞等对星阳音乐系统产品造成影响的行为。
          </li>
        </ul>
        <h2>知识产权</h2>
        <p>
          星阳音乐系统及本服务中受版权保护的任何内容，包括但不限于文本、图形、软件、数据库、算法等，均受版权法和其他相关法律的保护，内容的版权归其版权方所有。
        </p>
        <p>
          本产品内容来源于网络，仅提供检索服务，本产品不存储任何内容，也不承担任何责任。如果您需要使用本产品提供的检索服务，您应当自行负责获取相关内容的合法性。
        </p>
        <h2>第三方产品及服务</h2>
        <p>
          本服务可能包含对第三方产品或服务的引用或链接。这些引用或链接并不意味着我们对第三方产品或服务的认可或推荐。第三方产品或服务的提供者应独立承担责任，我们不对其产品或服务的质量、安全性或可用性提供任何保证。
        </p>
        <h2>数据隐私与安全</h2>
        <p>
          我们承诺保护用户的个人信息和数据安全。我们将采取合理的安全措施，以保护用户的信息不被未经授权的访问、使用或泄露。同时，我们也将按照法律法规的要求，在必要时向相关部门提供用户的个人信息，您可以查看下方的《隐私政策》了解。
        </p>
        <h2>投诉举报渠道</h2>
        <p>
          如果用户在使用本服务时发现任何违法违规行为、违法传播活动或有害信息等，可以通过我们的投诉举报渠道进行举报。我们会对相关内容进行审查，并根据情况采取相应的处理措施。
        </p>
        <h2>违约与赔偿</h2>
        <p>
          如果用户违反本协议或其他相关规定，我们将有权采取合理的处置措施，包括但不限于限制、暂停、终止用户使用本服务的部分或全部功能，删除用户上传、传播或提供的内容等。同时，用户还应承担相应的赔偿责任。
        </p>
        <h2>有限担保</h2>
        <p>
          我们对本服务的可用性和性能提供有限的担保。如果用户在使用本服务时遇到任何问题或有任何不满意之处，我们建议用户及时与我们联系并寻求解决方案。
        </p>
        <h2>责任限制</h2>
        <p>
          我们对因不可抗力或其他非人为因素造成的损失不承担任何责任。此外，对于因第三方的行为或疏忽导致的损失，我们也不承担任何责任。
        </p>
        <h2>协议更新与修改</h2>
        <p>
          我们有权随时更新和修改本协议的内容。当协议更新或修改后，用户应重新确认并接受本协议的全部内容才能继续使用本服务。如果用户不同意更新或修改后的协议内容，应立即停止使用本服务。
        </p>
        <h2>法律适用与争议解决</h2>
        <p>
          本协议的签订、履行和解释均适用中华人民共和国法律。本协议订立于内蒙古巴彦淖尔市。因本协议引起的任何争议应通过友好协商解决；协商不成的，应向协议签订地人民法院提起诉讼。
        </p>
      </div>
      <div style={{ padding: "15px" }} />
      <div>
        <h1>隐私政策</h1>

        <h2>导言</h2>
        <p>
          <i>星阳音乐系统</i> 是一款由 <i>小研同学</i> 开发、
          <i>小研同学</i> 运营（以下简称“我们”）的产品。
          您在使用我们的服务时，我们可能会收集和使用您的相关信息。我们希望通过本《隐私政策》向您说明，在使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。
          本《隐私政策》与您所使用的 <i>星阳音乐系统</i>{" "}
          服务息息相关，希望您仔细阅读，在需要时，按照本《隐私政策》的指引，作出您认为适当的选择。本《隐私政策》中涉及的相关技术词汇，我们尽量以简明扼要的表述，并提供进一步说明的链接，以便您的理解。
          本协议中的外部链接将在本协议尾部展示。
        </p>
        <p>
          <strong>
            免责声明：本网站内容来源于网络，仅提供检索服务。本网站不存储任何内容，也不承担任何责任。如果您需要使用本网站提供的检索服务，您应当自行负责获取相关内容的合法性和准确性。此外，本网站保留随时修改本声明的权利。如果您继续使用本网站，即表示您已经接受了本声明的所有修改。
          </strong>
          <strong>
            您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。
          </strong>
        </p>
        <p>
          如对本《隐私政策》或相关事宜有任何问题，请通过{" "}
          <strong>public@singtech.top</strong>{" "}
          与我们联系。一般情况下，我们将在30天内回复。
        </p>

        <h2>1. 我们收集的信息</h2>
        <p>
          我们或我们的第三方合作伙伴提供服务时，可能会收集、储存和使用下列与您有关的信息。如果您不提供相关信息，可能无法注册成为我们的用户或无法享受我们提供的某些服务，或者无法达到相关服务拟达到的效果。
        </p>

        <ul>
          <li>
            <strong>日志信息</strong>
            ，指您使用我们的服务时，系统可能通过cookies、标识符及相关技术收集的信息，包括您的
            <strong>设备信息</strong>、<strong>浏览信息</strong>、
            <strong>点击信息</strong>
            ，并将该等信息储存为日志信息，为您提供个性化的用户体验、保障服务安全。您可以通过浏览器设置拒绝或管理cookie、标识符或相关技术的使用。
          </li>
        </ul>

        <p>我们接入的第三方SDK：</p>
        <ul>
          <li>
            为向您提供【系统使用情况统计与日志收集】服务，我们集成了百度统计SDK。在为您提供【系统使用情况统计与日志收集】功能/服务时，百度统计SDK需要收集、使用您必要的个人信息。关于百度统计SDK收集、使用的个人信息类型、目的及用途，以及百度统计SDK将如何保护所收集、使用的个人信息，请您仔细阅读《百度统计隐私政策》了解。
          </li>
        </ul>

        <h2>2. 信息的存储</h2>
        <strong>2.1 信息存储的方式和期限</strong>
        <ul>
          <li>
            我们会通过安全的方式存储您的信息，包括本地存储（例如利用APP进行数据缓存）、数据库和服务器日志。
          </li>
          <li>
            一般情况下，我们只会在为实现服务目的所必需的时间内或法律法规规定的条件下存储您的个人信息。
          </li>
        </ul>

        <strong>2.2 信息存储的地域</strong>
        <ul>
          <li>
            我们会按照法律法规规定，将境内收集的用户个人信息存储于中国境内。
          </li>
          <li>
            目前我们不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我们会向您告知信息出境的目的、接收方、安全保证措施和安全风险，并征得您的同意。
          </li>
        </ul>

        <strong>2.3 产品或服务停止运营时的通知</strong>
        <ul>
          <li>
            当我们的产品或服务发生停止运营的情况时，我们将以推送通知、公告等形式通知您，并在合理期限内删除您的个人信息或进行匿名化处理，法律法规另有规定的除外。
          </li>
        </ul>

        <h2>3. 信息安全</h2>
        <p>
          我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
        </p>

        <h2>4. 我们如何使用信息</h2>
        <p>我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</p>
        <ul>
          <li>向您提供服务；</li>
          <li>
            在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
          </li>
          <li>帮助我们设计新服务，改善我们现有服务；</li>
          <li>
            使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；
          </li>
          <li>向您提供与您更加相关的广告以替代普遍投放的广告；</li>
          <li>评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；</li>
          <li>软件认证或管理软件升级；</li>
          <li>让您参与有关我们产品和服务的调查。</li>
        </ul>

        <h2>5. 信息共享</h2>
        <p>
          目前，我们不会主动共享或转让您的个人信息至第三方，如存在其他共享或转让您的个人信息或您需要我们将您的个人信息共享或转让至第三方情形时，我们会直接或确认第三方征得您对上述行为的明示同意。
        </p>
        <p>
          为了投放广告，评估、优化广告投放效果等目的，我们需要向广告主及其代理商等第三方合作伙伴共享您的部分数据，要求其严格遵守我们关于数据隐私保护的措施与要求，包括但不限于根据数据保护协议、承诺书及相关数据处理政策进行处理，避免识别出个人身份，保障隐私安全。
        </p>
        <p>
          我们不会向合作伙伴分享可用于识别您个人身份的信息（例如您的姓名或电子邮件地址），除非您明确授权。
        </p>
        <p>
          我们不会对外公开披露所收集的个人信息，如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。
        </p>
        <p>
          随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知您相关情形，按照法律法规及不低于本《隐私政策》所要求的标准继续保护或要求新的控制者继续保护您的个人信息。
        </p>
        <p>
          另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得您的授权同意：
        </p>
        <ul>
          <li>与国家安全、国防安全直接相关的；</li>
          <li>与公共安全、公共卫生、重大公共利益直接相关的；</li>
          <li>犯罪侦查、起诉、审判和判决执行等直接相关的；</li>
          <li>
            出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
          </li>
          <li>个人信息主体自行向社会公众公开个人信息的；</li>
          <li>
            从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
          </li>
        </ul>

        <h2>6. 您的权利</h2>
        <p>
          在您使用我们的服务期间，我们可能会视产品具体情况为您提供相应的操作设置，以便您可以查询、删除、更正或撤回您的相关个人信息，您可参考相应的具体指引进行操作。此外，我们还设置了投诉举报渠道，您的意见将会得到及时的处理。如果您无法通过上述途径和方式行使您的个人信息主体权利，您可以通过本《隐私政策》中提供的联系方式提出您的请求，我们会按照法律法规的规定予以反馈。
        </p>

        <h2>7. 变更</h2>
        <p>
          我们可能适时修订本《隐私政策》的条款。当变更发生时，我们会在版本更新时向您提示新的《隐私政策》，并向您说明生效日期。请您仔细阅读变更后的《隐私政策》内容，
          <strong>
            若您继续使用我们的服务，即表示您同意我们按照更新后的《隐私政策》处理您的个人信息。
          </strong>
        </p>

        <h2>8. 未成年人保护</h2>
        <p>
          我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交的个人信息之前寻求父母或监护人的同意和指导。
        </p>

        <h2>9. 外部链接</h2>
        <li>
          百度统计隐私政策：https://tongji.baidu.com/web/help/article?id=330&type=0；
        </li>
      </div>
    </div>
  );
};

export default UserAgreementAndPrivacyPolicy;
